practicals/ps6/tube/system/blockMeshDict

/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.;

Lx	#calc "5.4";
Ly      #calc "0.9";
nx      #calc "216";
ny      #calc "36";

vertices
(
    (0   0     0)
    ($Lx 0     0)
    ($Lx $Ly   0)
    (0   $Ly   0)
    (0   0     0.1)
    ($Lx 0     0.1)
    ($Lx $Ly   0.1)
    (0   $Ly   0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    topAndBottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (7 6 2 3)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
